reddit/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "banana"], ["url", "banana.com"], ["content", "banana!"], ["author_id", 2], ["created_at", "2019-09-10 19:42:58.613933"], ["updated_at", "2019-09-10 19:42:58.613933"]]
---
  def create
    debugger
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    # debugger
    # @post.sub_ids = params[:sub_ids]
    if @post.save