reddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Aww"], ["description", "Aww! Cute dogs"], ["user_id", "2"], ["created_at", "2019-09-10 19:01:01.714976"], ["updated_at", "2019-09-10 19:01:01.714976"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id
    if @sub.save