reddit/app/views/posts/new.html.erb

  <label>Add to Subs:</label>
  <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"